RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/cam_reg.h
/**
  ******************************************************************************
  * @file    cam_reg.h
  * @version V1.0
  * @date    2021-09-10
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __CAM_REG_H__
#define __CAM_REG_H__

#include "bl808.h"

/* 0x0 : dvp2axi_configue */
#define CAM_DVP2AXI_CONFIGUE_OFFSET  (0x0)
#define CAM_REG_DVP_ENABLE           CAM_REG_DVP_ENABLE
#define CAM_REG_DVP_ENABLE_POS       (0U)
#define CAM_REG_DVP_ENABLE_LEN       (1U)
#define CAM_REG_DVP_ENABLE_MSK       (((1U << CAM_REG_DVP_ENABLE_LEN) - 1) << CAM_REG_DVP_ENABLE_POS)
#define CAM_REG_DVP_ENABLE_UMSK      (~(((1U << CAM_REG_DVP_ENABLE_LEN) - 1) << CAM_REG_DVP_ENABLE_POS))
#define CAM_REG_SW_MODE              CAM_REG_SW_MODE
#define CAM_REG_SW_MODE_POS          (1U)
#define CAM_REG_SW_MODE_LEN          (1U)
#define CAM_REG_SW_MODE_MSK          (((1U << CAM_REG_SW_MODE_LEN) - 1) << CAM_REG_SW_MODE_POS)
#define CAM_REG_SW_MODE_UMSK         (~(((1U << CAM_REG_SW_MODE_LEN) - 1) << CAM_REG_SW_MODE_POS))
#define CAM_REG_FRAM_VLD_POL         CAM_REG_FRAM_VLD_POL
#define CAM_REG_FRAM_VLD_POL_POS     (2U)
#define CAM_REG_FRAM_VLD_POL_LEN     (1U)
#define CAM_REG_FRAM_VLD_POL_MSK     (((1U << CAM_REG_FRAM_VLD_POL_LEN) - 1) << CAM_REG_FRAM_VLD_POL_POS)
#define CAM_REG_FRAM_VLD_POL_UMSK    (~(((1U << CAM_REG_FRAM_VLD_POL_LEN) - 1) << CAM_REG_FRAM_VLD_POL_POS))
#define CAM_REG_LINE_VLD_POL         CAM_REG_LINE_VLD_POL
#define CAM_REG_LINE_VLD_POL_POS     (3U)
#define CAM_REG_LINE_VLD_POL_LEN     (1U)
#define CAM_REG_LINE_VLD_POL_MSK     (((1U << CAM_REG_LINE_VLD_POL_LEN) - 1) << CAM_REG_LINE_VLD_POL_POS)
#define CAM_REG_LINE_VLD_POL_UMSK    (~(((1U << CAM_REG_LINE_VLD_POL_LEN) - 1) << CAM_REG_LINE_VLD_POL_POS))
#define CAM_REG_XLEN                 CAM_REG_XLEN
#define CAM_REG_XLEN_POS             (4U)
#define CAM_REG_XLEN_LEN             (3U)
#define CAM_REG_XLEN_MSK             (((1U << CAM_REG_XLEN_LEN) - 1) << CAM_REG_XLEN_POS)
#define CAM_REG_XLEN_UMSK            (~(((1U << CAM_REG_XLEN_LEN) - 1) << CAM_REG_XLEN_POS))
#define CAM_REG_DVP_MODE             CAM_REG_DVP_MODE
#define CAM_REG_DVP_MODE_POS         (8U)
#define CAM_REG_DVP_MODE_LEN         (3U)
#define CAM_REG_DVP_MODE_MSK         (((1U << CAM_REG_DVP_MODE_LEN) - 1) << CAM_REG_DVP_MODE_POS)
#define CAM_REG_DVP_MODE_UMSK        (~(((1U << CAM_REG_DVP_MODE_LEN) - 1) << CAM_REG_DVP_MODE_POS))
#define CAM_REG_HW_MODE_FWRAP        CAM_REG_HW_MODE_FWRAP
#define CAM_REG_HW_MODE_FWRAP_POS    (11U)
#define CAM_REG_HW_MODE_FWRAP_LEN    (1U)
#define CAM_REG_HW_MODE_FWRAP_MSK    (((1U << CAM_REG_HW_MODE_FWRAP_LEN) - 1) << CAM_REG_HW_MODE_FWRAP_POS)
#define CAM_REG_HW_MODE_FWRAP_UMSK   (~(((1U << CAM_REG_HW_MODE_FWRAP_LEN) - 1) << CAM_REG_HW_MODE_FWRAP_POS))
#define CAM_REG_DROP_EN              CAM_REG_DROP_EN
#define CAM_REG_DROP_EN_POS          (12U)
#define CAM_REG_DROP_EN_LEN          (1U)
#define CAM_REG_DROP_EN_MSK          (((1U << CAM_REG_DROP_EN_LEN) - 1) << CAM_REG_DROP_EN_POS)
#define CAM_REG_DROP_EN_UMSK         (~(((1U << CAM_REG_DROP_EN_LEN) - 1) << CAM_REG_DROP_EN_POS))
#define CAM_REG_DROP_EVEN            CAM_REG_DROP_EVEN
#define CAM_REG_DROP_EVEN_POS        (13U)
#define CAM_REG_DROP_EVEN_LEN        (1U)
#define CAM_REG_DROP_EVEN_MSK        (((1U << CAM_REG_DROP_EVEN_LEN) - 1) << CAM_REG_DROP_EVEN_POS)
#define CAM_REG_DROP_EVEN_UMSK       (~(((1U << CAM_REG_DROP_EVEN_LEN) - 1) << CAM_REG_DROP_EVEN_POS))
#define CAM_REG_QOS_SW_MODE          CAM_REG_QOS_SW_MODE
#define CAM_REG_QOS_SW_MODE_POS      (14U)
#define CAM_REG_QOS_SW_MODE_LEN      (1U)
#define CAM_REG_QOS_SW_MODE_MSK      (((1U << CAM_REG_QOS_SW_MODE_LEN) - 1) << CAM_REG_QOS_SW_MODE_POS)
#define CAM_REG_QOS_SW_MODE_UMSK     (~(((1U << CAM_REG_QOS_SW_MODE_LEN) - 1) << CAM_REG_QOS_SW_MODE_POS))
#define CAM_REG_QOS_SW               CAM_REG_QOS_SW
#define CAM_REG_QOS_SW_POS           (15U)
#define CAM_REG_QOS_SW_LEN           (1U)
#define CAM_REG_QOS_SW_MSK           (((1U << CAM_REG_QOS_SW_LEN) - 1) << CAM_REG_QOS_SW_POS)
#define CAM_REG_QOS_SW_UMSK          (~(((1U << CAM_REG_QOS_SW_LEN) - 1) << CAM_REG_QOS_SW_POS))
#define CAM_REG_DVP_DATA_MODE        CAM_REG_DVP_DATA_MODE
#define CAM_REG_DVP_DATA_MODE_POS    (16U)
#define CAM_REG_DVP_DATA_MODE_LEN    (3U)
#define CAM_REG_DVP_DATA_MODE_MSK    (((1U << CAM_REG_DVP_DATA_MODE_LEN) - 1) << CAM_REG_DVP_DATA_MODE_POS)
#define CAM_REG_DVP_DATA_MODE_UMSK   (~(((1U << CAM_REG_DVP_DATA_MODE_LEN) - 1) << CAM_REG_DVP_DATA_MODE_POS))
#define CAM_REG_DVP_DATA_BSEL        CAM_REG_DVP_DATA_BSEL
#define CAM_REG_DVP_DATA_BSEL_POS    (19U)
#define CAM_REG_DVP_DATA_BSEL_LEN    (1U)
#define CAM_REG_DVP_DATA_BSEL_MSK    (((1U << CAM_REG_DVP_DATA_BSEL_LEN) - 1) << CAM_REG_DVP_DATA_BSEL_POS)
#define CAM_REG_DVP_DATA_BSEL_UMSK   (~(((1U << CAM_REG_DVP_DATA_BSEL_LEN) - 1) << CAM_REG_DVP_DATA_BSEL_POS))
#define CAM_REG_DVP_PIX_CLK_CG       CAM_REG_DVP_PIX_CLK_CG
#define CAM_REG_DVP_PIX_CLK_CG_POS   (20U)
#define CAM_REG_DVP_PIX_CLK_CG_LEN   (1U)
#define CAM_REG_DVP_PIX_CLK_CG_MSK   (((1U << CAM_REG_DVP_PIX_CLK_CG_LEN) - 1) << CAM_REG_DVP_PIX_CLK_CG_POS)
#define CAM_REG_DVP_PIX_CLK_CG_UMSK  (~(((1U << CAM_REG_DVP_PIX_CLK_CG_LEN) - 1) << CAM_REG_DVP_PIX_CLK_CG_POS))
#define CAM_REG_V_SUBSAMPLE_EN       CAM_REG_V_SUBSAMPLE_EN
#define CAM_REG_V_SUBSAMPLE_EN_POS   (22U)
#define CAM_REG_V_SUBSAMPLE_EN_LEN   (1U)
#define CAM_REG_V_SUBSAMPLE_EN_MSK   (((1U << CAM_REG_V_SUBSAMPLE_EN_LEN) - 1) << CAM_REG_V_SUBSAMPLE_EN_POS)
#define CAM_REG_V_SUBSAMPLE_EN_UMSK  (~(((1U << CAM_REG_V_SUBSAMPLE_EN_LEN) - 1) << CAM_REG_V_SUBSAMPLE_EN_POS))
#define CAM_REG_V_SUBSAMPLE_POL      CAM_REG_V_SUBSAMPLE_POL
#define CAM_REG_V_SUBSAMPLE_POL_POS  (23U)
#define CAM_REG_V_SUBSAMPLE_POL_LEN  (1U)
#define CAM_REG_V_SUBSAMPLE_POL_MSK  (((1U << CAM_REG_V_SUBSAMPLE_POL_LEN) - 1) << CAM_REG_V_SUBSAMPLE_POL_POS)
#define CAM_REG_V_SUBSAMPLE_POL_UMSK (~(((1U << CAM_REG_V_SUBSAMPLE_POL_LEN) - 1) << CAM_REG_V_SUBSAMPLE_POL_POS))
#define CAM_REG_DVP_WAIT_CYCLE       CAM_REG_DVP_WAIT_CYCLE
#define CAM_REG_DVP_WAIT_CYCLE_POS   (24U)
#define CAM_REG_DVP_WAIT_CYCLE_LEN   (8U)
#define CAM_REG_DVP_WAIT_CYCLE_MSK   (((1U << CAM_REG_DVP_WAIT_CYCLE_LEN) - 1) << CAM_REG_DVP_WAIT_CYCLE_POS)
#define CAM_REG_DVP_WAIT_CYCLE_UMSK  (~(((1U << CAM_REG_DVP_WAIT_CYCLE_LEN) - 1) << CAM_REG_DVP_WAIT_CYCLE_POS))

