RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/cam_reg.h
/* 0x4 : dvp2axi_addr_start */
#define CAM_DVP2AXI_ADDR_START_OFFSET (0x4)
#define CAM_REG_ADDR_START            CAM_REG_ADDR_START
#define CAM_REG_ADDR_START_POS        (0U)
#define CAM_REG_ADDR_START_LEN        (32U)
#define CAM_REG_ADDR_START_MSK        (((1U << CAM_REG_ADDR_START_LEN) - 1) << CAM_REG_ADDR_START_POS)
#define CAM_REG_ADDR_START_UMSK       (~(((1U << CAM_REG_ADDR_START_LEN) - 1) << CAM_REG_ADDR_START_POS))

/* 0x8 : dvp2axi_mem_bcnt */
#define CAM_DVP2AXI_MEM_BCNT_OFFSET (0x8)
#define CAM_REG_MEM_BURST_CNT       CAM_REG_MEM_BURST_CNT
#define CAM_REG_MEM_BURST_CNT_POS   (0U)
#define CAM_REG_MEM_BURST_CNT_LEN   (32U)
#define CAM_REG_MEM_BURST_CNT_MSK   (((1U << CAM_REG_MEM_BURST_CNT_LEN) - 1) << CAM_REG_MEM_BURST_CNT_POS)
#define CAM_REG_MEM_BURST_CNT_UMSK  (~(((1U << CAM_REG_MEM_BURST_CNT_LEN) - 1) << CAM_REG_MEM_BURST_CNT_POS))

/* 0xC : dvp_status_and_error */
#define CAM_DVP_STATUS_AND_ERROR_OFFSET (0xC)
#define CAM_REG_FRAME_CNT_TRGR_INT      CAM_REG_FRAME_CNT_TRGR_INT
#define CAM_REG_FRAME_CNT_TRGR_INT_POS  (0U)
#define CAM_REG_FRAME_CNT_TRGR_INT_LEN  (5U)
#define CAM_REG_FRAME_CNT_TRGR_INT_MSK  (((1U << CAM_REG_FRAME_CNT_TRGR_INT_LEN) - 1) << CAM_REG_FRAME_CNT_TRGR_INT_POS)
#define CAM_REG_FRAME_CNT_TRGR_INT_UMSK (~(((1U << CAM_REG_FRAME_CNT_TRGR_INT_LEN) - 1) << CAM_REG_FRAME_CNT_TRGR_INT_POS))
#define CAM_REG_INT_HCNT_EN             CAM_REG_INT_HCNT_EN
#define CAM_REG_INT_HCNT_EN_POS         (6U)
#define CAM_REG_INT_HCNT_EN_LEN         (1U)
#define CAM_REG_INT_HCNT_EN_MSK         (((1U << CAM_REG_INT_HCNT_EN_LEN) - 1) << CAM_REG_INT_HCNT_EN_POS)
#define CAM_REG_INT_HCNT_EN_UMSK        (~(((1U << CAM_REG_INT_HCNT_EN_LEN) - 1) << CAM_REG_INT_HCNT_EN_POS))
#define CAM_REG_INT_VCNT_EN             CAM_REG_INT_VCNT_EN
#define CAM_REG_INT_VCNT_EN_POS         (7U)
#define CAM_REG_INT_VCNT_EN_LEN         (1U)
#define CAM_REG_INT_VCNT_EN_MSK         (((1U << CAM_REG_INT_VCNT_EN_LEN) - 1) << CAM_REG_INT_VCNT_EN_POS)
#define CAM_REG_INT_VCNT_EN_UMSK        (~(((1U << CAM_REG_INT_VCNT_EN_LEN) - 1) << CAM_REG_INT_VCNT_EN_POS))
#define CAM_REG_INT_NORMAL_EN           CAM_REG_INT_NORMAL_EN
#define CAM_REG_INT_NORMAL_EN_POS       (8U)
#define CAM_REG_INT_NORMAL_EN_LEN       (1U)
#define CAM_REG_INT_NORMAL_EN_MSK       (((1U << CAM_REG_INT_NORMAL_EN_LEN) - 1) << CAM_REG_INT_NORMAL_EN_POS)
#define CAM_REG_INT_NORMAL_EN_UMSK      (~(((1U << CAM_REG_INT_NORMAL_EN_LEN) - 1) << CAM_REG_INT_NORMAL_EN_POS))
#define CAM_REG_INT_MEM_EN              CAM_REG_INT_MEM_EN
#define CAM_REG_INT_MEM_EN_POS          (9U)
#define CAM_REG_INT_MEM_EN_LEN          (1U)
#define CAM_REG_INT_MEM_EN_MSK          (((1U << CAM_REG_INT_MEM_EN_LEN) - 1) << CAM_REG_INT_MEM_EN_POS)
#define CAM_REG_INT_MEM_EN_UMSK         (~(((1U << CAM_REG_INT_MEM_EN_LEN) - 1) << CAM_REG_INT_MEM_EN_POS))
#define CAM_REG_INT_FRAME_EN            CAM_REG_INT_FRAME_EN
#define CAM_REG_INT_FRAME_EN_POS        (10U)
#define CAM_REG_INT_FRAME_EN_LEN        (1U)
#define CAM_REG_INT_FRAME_EN_MSK        (((1U << CAM_REG_INT_FRAME_EN_LEN) - 1) << CAM_REG_INT_FRAME_EN_POS)
#define CAM_REG_INT_FRAME_EN_UMSK       (~(((1U << CAM_REG_INT_FRAME_EN_LEN) - 1) << CAM_REG_INT_FRAME_EN_POS))
#define CAM_REG_INT_FIFO_EN             CAM_REG_INT_FIFO_EN
#define CAM_REG_INT_FIFO_EN_POS         (11U)
#define CAM_REG_INT_FIFO_EN_LEN         (1U)
#define CAM_REG_INT_FIFO_EN_MSK         (((1U << CAM_REG_INT_FIFO_EN_LEN) - 1) << CAM_REG_INT_FIFO_EN_POS)
#define CAM_REG_INT_FIFO_EN_UMSK        (~(((1U << CAM_REG_INT_FIFO_EN_LEN) - 1) << CAM_REG_INT_FIFO_EN_POS))
#define CAM_STS_NORMAL_INT              CAM_STS_NORMAL_INT
#define CAM_STS_NORMAL_INT_POS          (12U)
#define CAM_STS_NORMAL_INT_LEN          (1U)
#define CAM_STS_NORMAL_INT_MSK          (((1U << CAM_STS_NORMAL_INT_LEN) - 1) << CAM_STS_NORMAL_INT_POS)
#define CAM_STS_NORMAL_INT_UMSK         (~(((1U << CAM_STS_NORMAL_INT_LEN) - 1) << CAM_STS_NORMAL_INT_POS))
#define CAM_STS_MEM_INT                 CAM_STS_MEM_INT
#define CAM_STS_MEM_INT_POS             (13U)
#define CAM_STS_MEM_INT_LEN             (1U)
#define CAM_STS_MEM_INT_MSK             (((1U << CAM_STS_MEM_INT_LEN) - 1) << CAM_STS_MEM_INT_POS)
#define CAM_STS_MEM_INT_UMSK            (~(((1U << CAM_STS_MEM_INT_LEN) - 1) << CAM_STS_MEM_INT_POS))
#define CAM_STS_FRAME_INT               CAM_STS_FRAME_INT
#define CAM_STS_FRAME_INT_POS           (14U)
#define CAM_STS_FRAME_INT_LEN           (1U)
#define CAM_STS_FRAME_INT_MSK           (((1U << CAM_STS_FRAME_INT_LEN) - 1) << CAM_STS_FRAME_INT_POS)
#define CAM_STS_FRAME_INT_UMSK          (~(((1U << CAM_STS_FRAME_INT_LEN) - 1) << CAM_STS_FRAME_INT_POS))
#define CAM_STS_FIFO_INT                CAM_STS_FIFO_INT
#define CAM_STS_FIFO_INT_POS            (15U)
#define CAM_STS_FIFO_INT_LEN            (1U)
#define CAM_STS_FIFO_INT_MSK            (((1U << CAM_STS_FIFO_INT_LEN) - 1) << CAM_STS_FIFO_INT_POS)
#define CAM_STS_FIFO_INT_UMSK           (~(((1U << CAM_STS_FIFO_INT_LEN) - 1) << CAM_STS_FIFO_INT_POS))
#define CAM_FRAME_VALID_CNT             CAM_FRAME_VALID_CNT
#define CAM_FRAME_VALID_CNT_POS         (16U)
#define CAM_FRAME_VALID_CNT_LEN         (5U)
#define CAM_FRAME_VALID_CNT_MSK         (((1U << CAM_FRAME_VALID_CNT_LEN) - 1) << CAM_FRAME_VALID_CNT_POS)
#define CAM_FRAME_VALID_CNT_UMSK        (~(((1U << CAM_FRAME_VALID_CNT_LEN) - 1) << CAM_FRAME_VALID_CNT_POS))
#define CAM_STS_HCNT_INT                CAM_STS_HCNT_INT
#define CAM_STS_HCNT_INT_POS            (21U)
#define CAM_STS_HCNT_INT_LEN            (1U)
#define CAM_STS_HCNT_INT_MSK            (((1U << CAM_STS_HCNT_INT_LEN) - 1) << CAM_STS_HCNT_INT_POS)
#define CAM_STS_HCNT_INT_UMSK           (~(((1U << CAM_STS_HCNT_INT_LEN) - 1) << CAM_STS_HCNT_INT_POS))
#define CAM_STS_VCNT_INT                CAM_STS_VCNT_INT
#define CAM_STS_VCNT_INT_POS            (22U)
#define CAM_STS_VCNT_INT_LEN            (1U)
#define CAM_STS_VCNT_INT_MSK            (((1U << CAM_STS_VCNT_INT_LEN) - 1) << CAM_STS_VCNT_INT_POS)
#define CAM_STS_VCNT_INT_UMSK           (~(((1U << CAM_STS_VCNT_INT_LEN) - 1) << CAM_STS_VCNT_INT_POS))
#define CAM_ST_BUS_IDLE                 CAM_ST_BUS_IDLE
#define CAM_ST_BUS_IDLE_POS             (24U)
#define CAM_ST_BUS_IDLE_LEN             (1U)
#define CAM_ST_BUS_IDLE_MSK             (((1U << CAM_ST_BUS_IDLE_LEN) - 1) << CAM_ST_BUS_IDLE_POS)
#define CAM_ST_BUS_IDLE_UMSK            (~(((1U << CAM_ST_BUS_IDLE_LEN) - 1) << CAM_ST_BUS_IDLE_POS))
#define CAM_ST_BUS_FUNC                 CAM_ST_BUS_FUNC
#define CAM_ST_BUS_FUNC_POS             (25U)
#define CAM_ST_BUS_FUNC_LEN             (1U)
#define CAM_ST_BUS_FUNC_MSK             (((1U << CAM_ST_BUS_FUNC_LEN) - 1) << CAM_ST_BUS_FUNC_POS)
#define CAM_ST_BUS_FUNC_UMSK            (~(((1U << CAM_ST_BUS_FUNC_LEN) - 1) << CAM_ST_BUS_FUNC_POS))
#define CAM_ST_BUS_WAIT                 CAM_ST_BUS_WAIT
#define CAM_ST_BUS_WAIT_POS             (26U)
#define CAM_ST_BUS_WAIT_LEN             (1U)
#define CAM_ST_BUS_WAIT_MSK             (((1U << CAM_ST_BUS_WAIT_LEN) - 1) << CAM_ST_BUS_WAIT_POS)
#define CAM_ST_BUS_WAIT_UMSK            (~(((1U << CAM_ST_BUS_WAIT_LEN) - 1) << CAM_ST_BUS_WAIT_POS))
#define CAM_ST_BUS_FLSH                 CAM_ST_BUS_FLSH
#define CAM_ST_BUS_FLSH_POS             (27U)
#define CAM_ST_BUS_FLSH_LEN             (1U)
#define CAM_ST_BUS_FLSH_MSK             (((1U << CAM_ST_BUS_FLSH_LEN) - 1) << CAM_ST_BUS_FLSH_POS)
#define CAM_ST_BUS_FLSH_UMSK            (~(((1U << CAM_ST_BUS_FLSH_LEN) - 1) << CAM_ST_BUS_FLSH_POS))
#define CAM_AXI_IDLE                    CAM_AXI_IDLE
#define CAM_AXI_IDLE_POS                (28U)
#define CAM_AXI_IDLE_LEN                (1U)
#define CAM_AXI_IDLE_MSK                (((1U << CAM_AXI_IDLE_LEN) - 1) << CAM_AXI_IDLE_POS)
#define CAM_AXI_IDLE_UMSK               (~(((1U << CAM_AXI_IDLE_LEN) - 1) << CAM_AXI_IDLE_POS))
#define CAM_ST_DVP_IDLE                 CAM_ST_DVP_IDLE
#define CAM_ST_DVP_IDLE_POS             (29U)
#define CAM_ST_DVP_IDLE_LEN             (1U)
#define CAM_ST_DVP_IDLE_MSK             (((1U << CAM_ST_DVP_IDLE_LEN) - 1) << CAM_ST_DVP_IDLE_POS)
#define CAM_ST_DVP_IDLE_UMSK            (~(((1U << CAM_ST_DVP_IDLE_LEN) - 1) << CAM_ST_DVP_IDLE_POS))

/* 0x10 : dvp2axi_frame_bcnt */
#define CAM_DVP2AXI_FRAME_BCNT_OFFSET (0x10)
#define CAM_REG_FRAME_BYTE_CNT        CAM_REG_FRAME_BYTE_CNT
#define CAM_REG_FRAME_BYTE_CNT_POS    (0U)
#define CAM_REG_FRAME_BYTE_CNT_LEN    (32U)
#define CAM_REG_FRAME_BYTE_CNT_MSK    (((1U << CAM_REG_FRAME_BYTE_CNT_LEN) - 1) << CAM_REG_FRAME_BYTE_CNT_POS)
#define CAM_REG_FRAME_BYTE_CNT_UMSK   (~(((1U << CAM_REG_FRAME_BYTE_CNT_LEN) - 1) << CAM_REG_FRAME_BYTE_CNT_POS))

/* 0x14 : dvp_frame_fifo_pop */
#define CAM_DVP_FRAME_FIFO_POP_OFFSET (0x14)
#define CAM_RFIFO_POP                 CAM_RFIFO_POP
#define CAM_RFIFO_POP_POS             (0U)
#define CAM_RFIFO_POP_LEN             (1U)
#define CAM_RFIFO_POP_MSK             (((1U << CAM_RFIFO_POP_LEN) - 1) << CAM_RFIFO_POP_POS)
#define CAM_RFIFO_POP_UMSK            (~(((1U << CAM_RFIFO_POP_LEN) - 1) << CAM_RFIFO_POP_POS))
#define CAM_REG_INT_NORMAL_CLR        CAM_REG_INT_NORMAL_CLR
#define CAM_REG_INT_NORMAL_CLR_POS    (4U)
#define CAM_REG_INT_NORMAL_CLR_LEN    (1U)
#define CAM_REG_INT_NORMAL_CLR_MSK    (((1U << CAM_REG_INT_NORMAL_CLR_LEN) - 1) << CAM_REG_INT_NORMAL_CLR_POS)
#define CAM_REG_INT_NORMAL_CLR_UMSK   (~(((1U << CAM_REG_INT_NORMAL_CLR_LEN) - 1) << CAM_REG_INT_NORMAL_CLR_POS))
#define CAM_REG_INT_MEM_CLR           CAM_REG_INT_MEM_CLR
#define CAM_REG_INT_MEM_CLR_POS       (5U)
#define CAM_REG_INT_MEM_CLR_LEN       (1U)
#define CAM_REG_INT_MEM_CLR_MSK       (((1U << CAM_REG_INT_MEM_CLR_LEN) - 1) << CAM_REG_INT_MEM_CLR_POS)
#define CAM_REG_INT_MEM_CLR_UMSK      (~(((1U << CAM_REG_INT_MEM_CLR_LEN) - 1) << CAM_REG_INT_MEM_CLR_POS))
#define CAM_REG_INT_FRAME_CLR         CAM_REG_INT_FRAME_CLR
#define CAM_REG_INT_FRAME_CLR_POS     (6U)
#define CAM_REG_INT_FRAME_CLR_LEN     (1U)
#define CAM_REG_INT_FRAME_CLR_MSK     (((1U << CAM_REG_INT_FRAME_CLR_LEN) - 1) << CAM_REG_INT_FRAME_CLR_POS)
#define CAM_REG_INT_FRAME_CLR_UMSK    (~(((1U << CAM_REG_INT_FRAME_CLR_LEN) - 1) << CAM_REG_INT_FRAME_CLR_POS))
#define CAM_REG_INT_FIFO_CLR          CAM_REG_INT_FIFO_CLR
#define CAM_REG_INT_FIFO_CLR_POS      (7U)
#define CAM_REG_INT_FIFO_CLR_LEN      (1U)
#define CAM_REG_INT_FIFO_CLR_MSK      (((1U << CAM_REG_INT_FIFO_CLR_LEN) - 1) << CAM_REG_INT_FIFO_CLR_POS)
#define CAM_REG_INT_FIFO_CLR_UMSK     (~(((1U << CAM_REG_INT_FIFO_CLR_LEN) - 1) << CAM_REG_INT_FIFO_CLR_POS))
#define CAM_REG_INT_HCNT_CLR          CAM_REG_INT_HCNT_CLR
#define CAM_REG_INT_HCNT_CLR_POS      (8U)
#define CAM_REG_INT_HCNT_CLR_LEN      (1U)
#define CAM_REG_INT_HCNT_CLR_MSK      (((1U << CAM_REG_INT_HCNT_CLR_LEN) - 1) << CAM_REG_INT_HCNT_CLR_POS)
#define CAM_REG_INT_HCNT_CLR_UMSK     (~(((1U << CAM_REG_INT_HCNT_CLR_LEN) - 1) << CAM_REG_INT_HCNT_CLR_POS))
#define CAM_REG_INT_VCNT_CLR          CAM_REG_INT_VCNT_CLR
#define CAM_REG_INT_VCNT_CLR_POS      (9U)
#define CAM_REG_INT_VCNT_CLR_LEN      (1U)
#define CAM_REG_INT_VCNT_CLR_MSK      (((1U << CAM_REG_INT_VCNT_CLR_LEN) - 1) << CAM_REG_INT_VCNT_CLR_POS)
#define CAM_REG_INT_VCNT_CLR_UMSK     (~(((1U << CAM_REG_INT_VCNT_CLR_LEN) - 1) << CAM_REG_INT_VCNT_CLR_POS))

/* 0x18 : dvp2axi_frame_vld */
#define CAM_DVP2AXI_FRAME_VLD_OFFSET (0x18)
#define CAM_REG_FRAME_N_VLD          CAM_REG_FRAME_N_VLD
#define CAM_REG_FRAME_N_VLD_POS      (0U)
#define CAM_REG_FRAME_N_VLD_LEN      (32U)
#define CAM_REG_FRAME_N_VLD_MSK      (((1U << CAM_REG_FRAME_N_VLD_LEN) - 1) << CAM_REG_FRAME_N_VLD_POS)
#define CAM_REG_FRAME_N_VLD_UMSK     (~(((1U << CAM_REG_FRAME_N_VLD_LEN) - 1) << CAM_REG_FRAME_N_VLD_POS))

/* 0x1C : dvp2axi_frame_period */
#define CAM_DVP2AXI_FRAME_PERIOD_OFFSET (0x1C)
#define CAM_REG_FRAME_PERIOD            CAM_REG_FRAME_PERIOD
#define CAM_REG_FRAME_PERIOD_POS        (0U)
#define CAM_REG_FRAME_PERIOD_LEN        (5U)
#define CAM_REG_FRAME_PERIOD_MSK        (((1U << CAM_REG_FRAME_PERIOD_LEN) - 1) << CAM_REG_FRAME_PERIOD_POS)
#define CAM_REG_FRAME_PERIOD_UMSK       (~(((1U << CAM_REG_FRAME_PERIOD_LEN) - 1) << CAM_REG_FRAME_PERIOD_POS))

