RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/cam_reg.h
/* 0x20 : dvp2axi_misc */
#define CAM_DVP2AXI_MISC_OFFSET (0x20)
#define CAM_REG_ALPHA           CAM_REG_ALPHA
#define CAM_REG_ALPHA_POS       (0U)
#define CAM_REG_ALPHA_LEN       (8U)
#define CAM_REG_ALPHA_MSK       (((1U << CAM_REG_ALPHA_LEN) - 1) << CAM_REG_ALPHA_POS)
#define CAM_REG_ALPHA_UMSK      (~(((1U << CAM_REG_ALPHA_LEN) - 1) << CAM_REG_ALPHA_POS))
#define CAM_REG_FORMAT_565      CAM_REG_FORMAT_565
#define CAM_REG_FORMAT_565_POS  (8U)
#define CAM_REG_FORMAT_565_LEN  (3U)
#define CAM_REG_FORMAT_565_MSK  (((1U << CAM_REG_FORMAT_565_LEN) - 1) << CAM_REG_FORMAT_565_POS)
#define CAM_REG_FORMAT_565_UMSK (~(((1U << CAM_REG_FORMAT_565_LEN) - 1) << CAM_REG_FORMAT_565_POS))

/* 0x30 : dvp2axi_hsync_crop */
#define CAM_DVP2AXI_HSYNC_CROP_OFFSET (0x30)
#define CAM_REG_HSYNC_ACT_END         CAM_REG_HSYNC_ACT_END
#define CAM_REG_HSYNC_ACT_END_POS     (0U)
#define CAM_REG_HSYNC_ACT_END_LEN     (16U)
#define CAM_REG_HSYNC_ACT_END_MSK     (((1U << CAM_REG_HSYNC_ACT_END_LEN) - 1) << CAM_REG_HSYNC_ACT_END_POS)
#define CAM_REG_HSYNC_ACT_END_UMSK    (~(((1U << CAM_REG_HSYNC_ACT_END_LEN) - 1) << CAM_REG_HSYNC_ACT_END_POS))
#define CAM_REG_HSYNC_ACT_START       CAM_REG_HSYNC_ACT_START
#define CAM_REG_HSYNC_ACT_START_POS   (16U)
#define CAM_REG_HSYNC_ACT_START_LEN   (16U)
#define CAM_REG_HSYNC_ACT_START_MSK   (((1U << CAM_REG_HSYNC_ACT_START_LEN) - 1) << CAM_REG_HSYNC_ACT_START_POS)
#define CAM_REG_HSYNC_ACT_START_UMSK  (~(((1U << CAM_REG_HSYNC_ACT_START_LEN) - 1) << CAM_REG_HSYNC_ACT_START_POS))

/* 0x34 : dvp2axi_vsync_crop */
#define CAM_DVP2AXI_VSYNC_CROP_OFFSET (0x34)
#define CAM_REG_VSYNC_ACT_END         CAM_REG_VSYNC_ACT_END
#define CAM_REG_VSYNC_ACT_END_POS     (0U)
#define CAM_REG_VSYNC_ACT_END_LEN     (16U)
#define CAM_REG_VSYNC_ACT_END_MSK     (((1U << CAM_REG_VSYNC_ACT_END_LEN) - 1) << CAM_REG_VSYNC_ACT_END_POS)
#define CAM_REG_VSYNC_ACT_END_UMSK    (~(((1U << CAM_REG_VSYNC_ACT_END_LEN) - 1) << CAM_REG_VSYNC_ACT_END_POS))
#define CAM_REG_VSYNC_ACT_START       CAM_REG_VSYNC_ACT_START
#define CAM_REG_VSYNC_ACT_START_POS   (16U)
#define CAM_REG_VSYNC_ACT_START_LEN   (16U)
#define CAM_REG_VSYNC_ACT_START_MSK   (((1U << CAM_REG_VSYNC_ACT_START_LEN) - 1) << CAM_REG_VSYNC_ACT_START_POS)
#define CAM_REG_VSYNC_ACT_START_UMSK  (~(((1U << CAM_REG_VSYNC_ACT_START_LEN) - 1) << CAM_REG_VSYNC_ACT_START_POS))

/* 0x38 : dvp2axi_fram_exm */
#define CAM_DVP2AXI_FRAM_EXM_OFFSET (0x38)
#define CAM_REG_TOTAL_HCNT          CAM_REG_TOTAL_HCNT
#define CAM_REG_TOTAL_HCNT_POS      (0U)
#define CAM_REG_TOTAL_HCNT_LEN      (16U)
#define CAM_REG_TOTAL_HCNT_MSK      (((1U << CAM_REG_TOTAL_HCNT_LEN) - 1) << CAM_REG_TOTAL_HCNT_POS)
#define CAM_REG_TOTAL_HCNT_UMSK     (~(((1U << CAM_REG_TOTAL_HCNT_LEN) - 1) << CAM_REG_TOTAL_HCNT_POS))
#define CAM_REG_TOTAL_VCNT          CAM_REG_TOTAL_VCNT
#define CAM_REG_TOTAL_VCNT_POS      (16U)
#define CAM_REG_TOTAL_VCNT_LEN      (16U)
#define CAM_REG_TOTAL_VCNT_MSK      (((1U << CAM_REG_TOTAL_VCNT_LEN) - 1) << CAM_REG_TOTAL_VCNT_POS)
#define CAM_REG_TOTAL_VCNT_UMSK     (~(((1U << CAM_REG_TOTAL_VCNT_LEN) - 1) << CAM_REG_TOTAL_VCNT_POS))

/* 0x40 : frame_start_addr0 */
#define CAM_FRAME_START_ADDR0_OFFSET (0x40)
#define CAM_FRAME_START_ADDR_0       CAM_FRAME_START_ADDR_0
#define CAM_FRAME_START_ADDR_0_POS   (0U)
#define CAM_FRAME_START_ADDR_0_LEN   (32U)
#define CAM_FRAME_START_ADDR_0_MSK   (((1U << CAM_FRAME_START_ADDR_0_LEN) - 1) << CAM_FRAME_START_ADDR_0_POS)
#define CAM_FRAME_START_ADDR_0_UMSK  (~(((1U << CAM_FRAME_START_ADDR_0_LEN) - 1) << CAM_FRAME_START_ADDR_0_POS))

/* 0x48 : frame_start_addr1 */
#define CAM_FRAME_START_ADDR1_OFFSET (0x48)
#define CAM_FRAME_START_ADDR_1       CAM_FRAME_START_ADDR_1
#define CAM_FRAME_START_ADDR_1_POS   (0U)
#define CAM_FRAME_START_ADDR_1_LEN   (32U)
#define CAM_FRAME_START_ADDR_1_MSK   (((1U << CAM_FRAME_START_ADDR_1_LEN) - 1) << CAM_FRAME_START_ADDR_1_POS)
#define CAM_FRAME_START_ADDR_1_UMSK  (~(((1U << CAM_FRAME_START_ADDR_1_LEN) - 1) << CAM_FRAME_START_ADDR_1_POS))

/* 0x50 : frame_start_addr2 */
#define CAM_FRAME_START_ADDR2_OFFSET (0x50)
#define CAM_FRAME_START_ADDR_2       CAM_FRAME_START_ADDR_2
#define CAM_FRAME_START_ADDR_2_POS   (0U)
#define CAM_FRAME_START_ADDR_2_LEN   (32U)
#define CAM_FRAME_START_ADDR_2_MSK   (((1U << CAM_FRAME_START_ADDR_2_LEN) - 1) << CAM_FRAME_START_ADDR_2_POS)
#define CAM_FRAME_START_ADDR_2_UMSK  (~(((1U << CAM_FRAME_START_ADDR_2_LEN) - 1) << CAM_FRAME_START_ADDR_2_POS))

/* 0x58 : frame_start_addr3 */
#define CAM_FRAME_START_ADDR3_OFFSET (0x58)
#define CAM_FRAME_START_ADDR_3       CAM_FRAME_START_ADDR_3
#define CAM_FRAME_START_ADDR_3_POS   (0U)
#define CAM_FRAME_START_ADDR_3_LEN   (32U)
#define CAM_FRAME_START_ADDR_3_MSK   (((1U << CAM_FRAME_START_ADDR_3_LEN) - 1) << CAM_FRAME_START_ADDR_3_POS)
#define CAM_FRAME_START_ADDR_3_UMSK  (~(((1U << CAM_FRAME_START_ADDR_3_LEN) - 1) << CAM_FRAME_START_ADDR_3_POS))

/* 0x60 : frame_id_sts01 */
#define CAM_FRAME_ID_STS01_OFFSET (0x60)
#define CAM_FRAME_ID_0            CAM_FRAME_ID_0
#define CAM_FRAME_ID_0_POS        (0U)
#define CAM_FRAME_ID_0_LEN        (16U)
#define CAM_FRAME_ID_0_MSK        (((1U << CAM_FRAME_ID_0_LEN) - 1) << CAM_FRAME_ID_0_POS)
#define CAM_FRAME_ID_0_UMSK       (~(((1U << CAM_FRAME_ID_0_LEN) - 1) << CAM_FRAME_ID_0_POS))
#define CAM_FRAME_ID_1            CAM_FRAME_ID_1
#define CAM_FRAME_ID_1_POS        (16U)
#define CAM_FRAME_ID_1_LEN        (16U)
#define CAM_FRAME_ID_1_MSK        (((1U << CAM_FRAME_ID_1_LEN) - 1) << CAM_FRAME_ID_1_POS)
#define CAM_FRAME_ID_1_UMSK       (~(((1U << CAM_FRAME_ID_1_LEN) - 1) << CAM_FRAME_ID_1_POS))

/* 0x64 : frame_id_sts23 */
#define CAM_FRAME_ID_STS23_OFFSET (0x64)
#define CAM_FRAME_ID_2            CAM_FRAME_ID_2
#define CAM_FRAME_ID_2_POS        (0U)
#define CAM_FRAME_ID_2_LEN        (16U)
#define CAM_FRAME_ID_2_MSK        (((1U << CAM_FRAME_ID_2_LEN) - 1) << CAM_FRAME_ID_2_POS)
#define CAM_FRAME_ID_2_UMSK       (~(((1U << CAM_FRAME_ID_2_LEN) - 1) << CAM_FRAME_ID_2_POS))
#define CAM_FRAME_ID_3            CAM_FRAME_ID_3
#define CAM_FRAME_ID_3_POS        (16U)
#define CAM_FRAME_ID_3_LEN        (16U)
#define CAM_FRAME_ID_3_MSK        (((1U << CAM_FRAME_ID_3_LEN) - 1) << CAM_FRAME_ID_3_POS)
#define CAM_FRAME_ID_3_UMSK       (~(((1U << CAM_FRAME_ID_3_LEN) - 1) << CAM_FRAME_ID_3_POS))

