RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/cam_reg.h
    /* 0x20 : dvp2axi_misc */
    union {
        struct {
            uint32_t reg_alpha      : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_format_565 : 3;  /* [10: 8],        r/w,        0x0 */
            uint32_t reserved_11_31 : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dvp2axi_misc;

    /* 0x24  reserved */
    uint8_t RESERVED0x24[12];

    /* 0x30 : dvp2axi_hsync_crop */
    union {
        struct {
            uint32_t reg_hsync_act_end   : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t reg_hsync_act_start : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dvp2axi_hsync_crop;

    /* 0x34 : dvp2axi_vsync_crop */
    union {
        struct {
            uint32_t reg_vsync_act_end   : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t reg_vsync_act_start : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dvp2axi_vsync_crop;

    /* 0x38 : dvp2axi_fram_exm */
    union {
        struct {
            uint32_t reg_total_hcnt : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_total_vcnt : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dvp2axi_fram_exm;

    /* 0x3c  reserved */
    uint8_t RESERVED0x3c[4];

    /* 0x40 : frame_start_addr0 */
    union {
        struct {
            uint32_t frame_start_addr_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr0;

    /* 0x44  reserved */
    uint8_t RESERVED0x44[4];

    /* 0x48 : frame_start_addr1 */
    union {
        struct {
            uint32_t frame_start_addr_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr1;

    /* 0x4c  reserved */
    uint8_t RESERVED0x4c[4];

    /* 0x50 : frame_start_addr2 */
    union {
        struct {
            uint32_t frame_start_addr_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr2;

    /* 0x54  reserved */
    uint8_t RESERVED0x54[4];

    /* 0x58 : frame_start_addr3 */
    union {
        struct {
            uint32_t frame_start_addr_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr3;

    /* 0x5c  reserved */
    uint8_t RESERVED0x5c[4];

    /* 0x60 : frame_id_sts01 */
    union {
        struct {
            uint32_t frame_id_0 : 16; /* [15: 0],          r,        0x0 */
            uint32_t frame_id_1 : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_id_sts01;

    /* 0x64 : frame_id_sts23 */
    union {
        struct {
            uint32_t frame_id_2 : 16; /* [15: 0],          r,        0x0 */
            uint32_t frame_id_3 : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_id_sts23;

    /* 0x68  reserved */
    uint8_t RESERVED0x68[136];

    /* 0xF0 : dvp_debug */
    union {
        struct {
            uint32_t reg_dvp_dbg_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_dvp_dbg_sel   : 3;  /* [ 3: 1],        r/w,        0x0 */
            uint32_t reserved_4_7      : 4;  /* [ 7: 4],       rsvd,        0x0 */
            uint32_t reg_id_latch_line : 4;  /* [11: 8],        r/w,        0x5 */
            uint32_t reserved_12_31    : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dvp_debug;

    /* 0xf4  reserved */
    uint8_t RESERVED0xf4[8];

    /* 0xFC : dvp_dummy_reg */
    union {
        struct {
            uint32_t RESERVED_31_0 : 32; /* [31: 0],       rsvd, 0xf0f0f0f0 */
        } BF;
        uint32_t WORD;
    } dvp_dummy_reg;
};

typedef volatile struct cam_reg cam_reg_t;

#endif /* __CAM_REG_H__ */
